/*
Structure:
BaseProject- для обчислення медіани та середнього значення:
Головна ідея програми, метод ініціалізації змінних, виведення даних
Метод зчитування десяткових чисел
Метод конвертації десяткових чисел у бінарні
Метод сортуваня бінарного масиву злиттям(основна логіка)
Метод для злиття двох підмасивів сортування
Метод обчислення медіани відсортованого масиву бінарних чисел
Метод для обчислення середнього значення з цього ж масиву
Метод для повернення десяткового значення бінарного числа 
*/
